Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The character after the question mark indicates the extension.
es_es: El carácter situado detrás del signo de interrogación indica la extensión.

source: %hash = map { "\L$_" => 1 } @array # perl guesses EXPR.
es_es: %hash = map { "\L$_" => 1 } @array # perl lee mal la EXPR.

source: cd / chmod +t /tmp (=set the sticky bit to /tmp).
es_es: cd / chmod +t /tmp (=pone el sticky bit a /tmp).

source: If you want to release a 'beta' or 'alpha' version of a module but don't want CPAN.pm to list it as most recent use an '_' after the regular version number followed by at least 2 digits, eg.
es_es: Si desea liberar una versión 'beta' o 'alfa' de un módulo, pero no quiere que CPAN.pm lo liste, use un '_' después del número de versión normal seguido por al menos dos dígitos, por ejemplo.

source: REFERENCES
es_es: REFERENCIAS

source: These are typically followed by a repeat count like C<B8> or C<B64>.
es_es: Estos suelen ser seguidos por un número de repetición, como C<B8> o C<B64>.

source: Although this means that Perl is now more "correct", it is possible that some existing code will break that happens to rely on the faulty behaviour.
es_es: Aunque esto significa que Perl es más "correcto", es posible que algún código existente se rompa, por confiar en el comportamiento defectuoso.

source: Similar for two matches for C<T>.
es_es: Similar para las dos coincidencias de C<T>.

source: push $AoA[0], "wilma", "betty"; # implicit deref
es_es: push $AoA[0], "wilma", "betty"; # desreferencia implícita

source: $now_string = strftime "%a %b %e %H:%M:%S %Y", gmtime;
es_es: $ahora = strftime "%a %b %e %H:%M:%S %Y", gmtime;

source: Either way, the implementation isn't going to generate results larger than the size of the integer type Perl was built with (32 bits or 64 bits).
es_es: De cualquier manera, la aplicación no va a generar resultados más grandes que el tamaño del tipo entero con el que Perl fue construido (32 o 64 bits).

source: eval "tr/$oldlist/$newlist/";
es_es: eval "tr/$viejalista/$nuevalista/";

source: If no C<(*MARK)> of that name was encountered, then the C<(*SKIP)> operator has no effect.
es_es: Si no se encontró ningún C<(*MARK)>, entonces el operador C<(*SKIP)> no tiene ningún efecto.

source: C<prefix_pattern> has now been complemented by a new configuration option C<long_prefix_pattern> that allows the user to specify what prefix patterns should have long option style semantics applied.
es_es: C<prefix_pattern> ha sido complementado por una nueva opción de configuración, C<long_prefix_pattern>, que permite al usuario especificar qué patrones de prefijo deben tener aplicado un estilo semántico para opciones largas.

source: Note that the "input line number" (also known as "chunk") is subject to whatever notion of "line" happens to be currently in effect, and is also available as the special variable C<$.>.
es_es: Note que el "número de línea de entrada" (también conocido como "chunk" -tarugo-) está sujeto a cualquier noción de "línea" que sea efectiva en ese momento, y también está disponible en la variable especial C<$.>.

source: perldos Perl notes for DOS
es_es: perldos Notas para DOS

source: An inner BLOCK may countermand this by saying
es_es: Un BLOQUE interno puede revocar esto diciendo

source: C<Filter::Simple> upgraded to version 0.82
es_es: C<Filter::Simple> actualizado a la versión 0.82

source: my @lines = <$in>;
es_es: my @lineas = <$entrada>;

source: Think about reusability.
es_es: Piense en la reutilización.

source: or two.
es_es: o dos.

source: This is very useful for providing default values for variables.
es_es: Esto es muy útil para proporcionar valores por defecto a las variables.

source: Returns the number of elements in the array following the completed C<push>.
es_es: Devuelve el número de elementos en el ARRAY tras la llamada a C<push>.

source: Zero-length matches at the end of the previous match are ignored during C<split>.
es_es: Coincidencias de longitud cero al final de la coincidencia anterior son ignoradas durante C<split>.

source: Space around a "complex" subscript (inside brackets).
es_es: Espacio alrededor de un subíndice "complejo" (entre corchetes).

source: =item (R&NAME)
es_es: =item (R&NOMBRE)

source: perl - The Perl 5 language interpreter
es_es: perl - El intérprete del lenguaje Perl

source: print $log $logmessage;
es_es: print $registro $mensaje_registro;

source: Will cause C<$sentence> to become C<'The big bad wolf jumped over...'>.
es_es: Hará que C<$instruccion> se convierta en C<'El gran lobo malo saltó sobre ...'>.

source: except that the globbing is actually done internally using the standard C<File::Glob> extension.
es_es: salvo que la expansión realmente se hace internamente usando la extensión estándar C<File::Glob>.

source: =item socketpair SOCKET1,SOCKET2,DOMAIN,TYPE,PROTOCOL X<socketpair>
es_es: =item socketpair SOCKET1,SOCKET2,DOMINIO,TIPO,PROTOCOLO X<socketpair>

source: In other words, you can write:
es_es: En otras palabras, puede escribir:

source: $foo = '150' | '105'; # yields string '155' (under ASCII)
es_es: $foo = '150' | '105'; # produce la cadena '155' (bajo ASCII)

source: lock() is a "weak keyword" : this means that if you've defined a function by this name (before any calls to it), that function will be called instead.
es_es: lock() es una "palabra clave débil": significa que si usted ha definido una función con este nombre (antes de cualquier llamada a ella), esa función es la que se llamará.

source: You may combine several flags using the C<|>-operator.
es_es: Puede combinar varias banderas con el operador C<|>.

source: my $foo = decode('UTF-8', get 'http://example.com/');
es_es: my $foo = decode('UTF-8', get 'http://ejemplo.com/');

source: It can test the right operand and become false on the same evaluation it became true (as in B<awk>), but it still returns true once.
es_es: El operador rango puede probar el operando de la derecha y convertirse en falso en la misma evaluación en que se hizo verdadero (como en B<awk>), pero aún así devuelve verdadero al menos una vez.

source: If the referenced object has been blessed into a package, then that package name is returned instead.
es_es: Si el objeto referenciado ha sido bendecido en un paquete, entonces es el nombre de este paquete el que es devuelto en su lugar.

source: The Unix standard Perl location, F</usr/bin/perl>, is no longer overwritten by default if it exists.
es_es: La ubicación estándar de Perl en Unix, F</usr/bin/perl>, ya no es, por defecto, sobreescrita, si existe.

source: With EXPR, it returns some extra information that the debugger uses to print a stack trace.
es_es: Con EXPR, devuelve alguna información extra que el depurador usa para imprimir un rastreo de la pila.

source: On ASCII platforms, the native rules are ASCII, and on EBCDIC platforms (at least the ones that Perl handles), they are Latin-1.
es_es: En plataformas ASCII, las reglas nativas son ASCII, y en plataformas EBCDIC (por lo menos las que Perl maneja), son Latin-1.

source: But wait, there's more...
es_es: Pero esto no es todo.

source: See also L</exp> for the inverse operation.
es_es: Vea también L</exp> para la operación inversa.

source: INNER: for my $jet (@ary2) {
es_es: INTERNO: for my $jet (@ary2) {

source: Evaluates BLOCK or EXPR in list context, so each element of LIST may produce zero, one, or more elements in the returned value.
es_es: Evalúa BLOQUE o EXPR en contexto lista, de manera que cada elemento de la LISTA puede producir cero, uno o más elementos en el valor devuelto.

source: Support C<[2,-3pi/8]> in C<emake>
es_es: Soporte de C<[2,-3pi/8]> en C<emake>

source: logger("We have a logger subroutine!");
es_es: registrador("Tenemos una subrutina para registrar.");

source: 1 ino inode number
es_es: 1 ino número de inodo

source: warn "not a natural number" unless /^\d+$/; # rejects -3
es_es: warn "no es número natural" unless /^\d+$/; # rechaza -3

source: In case you are wondering about 5.6.1, it was bug-fix-wise rather identical to the development release 5.7.1.
es_es: En caso de que usted se está preguntando sobre 5.6.1, fue una corrección de errores, idéntica a la versión de desarrollo 5.7.1.

source: Be careful not to follow the print keyword with a left parenthesis unless you want the corresponding right parenthesis to terminate the arguments to the print; put parentheses around all arguments (or interpose a C<+>, but that doesn't look as good).
es_es: Tenga cuidado de no seguir la palabra clave print con un paréntesis de apertura a menos que desee que el correspondiente paréntesis de cierre ponga fin a los argumentos de la impresión; ponga paréntesis alrededor de todos los argumentos (o interponga un C<+>, pero esto no parece tan bonito).

source: Attempts to send the scalar MSG to the SOCKET filehandle.
es_es: Intenta enviar el escalar MSG al identificador de archivo SOCKET.

source: As a workaround for this problem, Perl 5.10.0 introduces C<${^PREMATCH}>, C<${^MATCH}> and C<${^POSTMATCH}>, which are equivalent to C<$`>, C<$&> and C<$'>, B<except> that they are only guaranteed to be defined after a successful match that was executed with the C</p> (preserve) modifier.
es_es: Como solución a este problema, Perl Perl 5.10.0 introduce C<${^PREMATCH}>, C<${^MATCH}> y C<${^POSTMATCH}>, que son equivalentes a C<$`>, C<$&> y C<$'>, B<excepto> que solo se tiene garantizado que estarán definidos después de una coincidencia exitosa, ejecutada con un modificador C</p> (preserva).

source: Use of C<goto-LABEL> or C<goto-EXPR> to jump into a construct is deprecated and will issue a warning.
es_es: El uso de C<goto-LABEL> o C<goto-EXPR> para saltar en una construcción es obsoleto y emitirá una advertencia.

source: Decimal strings may have an exponential notation part, as in C<"12.34e-56">.
es_es: Las cadenas decimales pueden tener una parte en notación exponencial (por ejemplo, C<"12.34e-56">).

source: If you are using gcc, just
es_es: Si está empleando gcc, entonces

source: (To view the differences between the 5.6.0 release and the 5.7.0 release, see L<perl570delta>.
es_es: (Para ver las diferencias entre la versión 5.6.0 y la versión 5.7.0, vea L<perl570delta>.

source: perllol Perl data structures: arrays of arrays
es_es: perllol Estructuras de datos: arrays de arrays

source: Options are as described in C<qr//> above; in addition, the following match process modifiers are available:
es_es: Las opciones son como se describe anteriormente en C<qr//>; además, los siguientes modificadores de coincidencia están disponibles:

source: Dereference-address operator.
es_es: Operador de Desreferencia.

source: Sends a message on a socket.
es_es: Envía un mensaje sobre un socket.

source: \W a non-word character
es_es: \W un carácter que no sea de palabra

source: my %h = ("something", 23);
es_es: my %h = ("algo", 23);

source: A statement sequence may contain declarations of lexically-scoped variables, but apart from declaring a variable name, the declaration acts like an ordinary statement, and is elaborated within the sequence of statements as if it were an ordinary statement.
es_es: Una secuencia de instrucciones pueden contener declaraciones de variables en ámbito léxico (privado), pero, aparte de declarar un nombre de variable, la declaración actúa como una instrucción normal y es elaborada dentro de la secuencia de instrucciones como si fuera una instrucción normal.

source: $^ = 'report2_top';
es_es: $^ = 'informe2_top';

source: print(" Capitalized"), redo LOOP if /\G\p{Lu}\p{Ll}+\b[,.;]?\s*/gc;
es_es: print(" Capitalizado"), redo LOOP if /\G\p{Lu}\p{Ll}+\b[,.;]?\s*/gc;

source: This warning has been removed.
es_es: Esta advertencia ha sido eliminada.

source: Perl only supports single-byte locales.
es_es: Perl sólo soporta reglas regionales de bytes simples.

source: Problem with partial characters and C<< encoding(utf-8-strict) >> fixed.
es_es: Arreglado un problema con caracteres no completos y C<< encoding(utf-8-strict) >>.

source: In the syntax descriptions that follow, list operators that expect a list (and provide list context for elements of the list) are shown with LIST as an argument.
es_es: En las descripciones sintácticas que siguen a continuación, los operadores de listas que esperan una lista (y proveen de un contexto lista para los elementos de la lista) se muestran con un argumento así: LISTA.

source: Many of the beginner-level books, too, go over basic features and techniques that are still valid today.
es_es: Muchos de los libros para principiantes describen características y técnicas básicas que mantienen su vigencia.

source: It is assumed that you already know the difference between bytes and characters, and realise (and accept!) that there are many different character sets and encodings, and that your program has to be explicit about them.
es_es: Se supone que ya conoce la diferencia entre bytes y caracteres, y comprende (y acepta) que hay muchos juegos de caracteres y codificaciones distintos, que debe utilizar explícitamente en su programa.

source: You can always include optional parameters or routines for more complex or non-standard behaviour.
es_es: Siempre puede incluir parámetros opcionales o rutinas para un comportamiento más complejo o no estándar.

source: The "lib/anydbm" and "pragma/warnings" tests will almost certainly fail.
es_es: Es muy probable que no se superen las pruebas "lib/anydbm" y "pragma/warnings".

source: Perl 5.12.3 represents approximately four months of development since Perl 5.12.2 and contains approximately 2500 lines of changes across 54 files from 16 authors.
es_es: Perl 5.12.3 representa aproximadamente cuatro meses de desarrollo desde Perl 5.12.2 y contiene aproximadamente 2500 líneas de cambios en 54 archivos de 16 autores.

source: @a = (1)[1,0]; # @a has two elements
es_es: @a = (1)[1,0]; # @a tiene dos elementos

source: The initial Haiku port was done by Ingo Weinhold <ingo_weinhold@gmx.de>.
es_es: La primera adaptación de Haiku fue realizada por Ingo Weinhold <ingo_weinhold@gmx.de>.

source: # extract hours, minutes, seconds
es_es: # extraer horas, minutos, segundos

source: C<$^O> could sometimes become tainted.
es_es: C<$^O> podría estar, algunas veces, pringada.

source: The debugger now traces correctly execution in eval("")uated code that contains #line directives.
es_es: El depurador, ahora, sigue la traza correctamente en la ejecución de código eval("")uado que contenga directivas #line.

source: char c; /* one signed, 8-bit character */
es_es: char c; /* uno con signo, carácter 8-bit */

source: Hex strings may only represent integers.
es_es: Strings hexadecimales sólo pueden representar enteros.

source: or die "Could not determine the protocol number for tcp";
es_es: or die "No puedo determinar el número de protocolo para tcp";

source: but that makes no difference compared with the -Duse64bitint because of the C<cc -64>.
es_es: pero no genera diferencias comparado con -Duse64bitint debido al C<cc -64>.

source: C<@INC> is also printed as part of the output of
es_es: C<@INC> también se imprime en pantalla como parte de la salida de

source: An explicit format parameter index, such as C<2$>.
es_es: Un explícito índice de parámetros de formato, tales como C<2$>.

source: %HASH = (); # completely empty %HASH
es_es: %HASH = (); # vaciar completamente %HASH

source: As shown in the example above, a bare C<l> means exactly 32 bits, although the native C<long> as seen by the local C compiler may be larger.
es_es: Como se muestra en el ejemplo anterior, una simple C<l> significa exactamente 32 bits, aunque el C<long> nativo, tal como lo ve el compilador de C local, puede ser mayor.

source: If you're not on a Unix system, access to the documentation will be different; for example, documentation might only be in HTML format.
es_es: Si no utiliza un sistema Unix, el acceso a la documentación será distinto; por ejemplo, la documentación puede estar disponible en formato HTML únicamente.

source: The list C<1,,3> is a concatenation of two lists, C<1,> and C<3>, the first of which ends with that optional comma.
es_es: La lista C<1,,3> es una concatenación de dos listas, C<1,> y C<3>, la primera de las cuales termina con una coma opcional.

source: README.linux - Perl version 5 on Linux systems
es_es: README.linux - Perl versión 5 sobre sistemas Linux

source: =item caller EXPR X<caller> X<call stack> X<stack> X<stack trace>
es_es: =item caller EXPR X<caller> X<call stack> X<stack> X<stack trace> X<llamador> X<pila de llamdas> X<pila> X<traza de pila>

source: =item rindex STR,SUBSTR,POSITION X<rindex>
es_es: =item rindex CADENA,SUBCADENA,POSICIÓN X<rindex>

source: uses C<$a> for the width, C<$b> for the precision, and C<$c> as the value to format; while:
es_es: usa C<$a> para el ancho, C<$b> para la precisión, y C<$c> como el valor a formatear; mientras:

source: (errno) properly when there were errors in the underlying call.
es_es: (errno) correctamente cuando se han producido errores en la llamada subyacente.

source: Some people get too used to writing things like:
es_es: Algunas personas están demasiado acostumbradas a escribir cosas como:

source: perlfaq2 - Obtaining and Learning about Perl
es_es: perlfaq2 - Cómo obtener Perl y dónde buscar información sobre Perl

source: Also, C<\c\I<X>> yields C< chr(28) . "I<X>"> for any I<X>, but cannot come at the end of a string, because the backslash would be parsed as escaping the end quote.
es_es: Además, C<\c\I<X>> es igual a C< chr(28) . "I<X>"> para cualquier I<X>, pero no puede estar al final de una cadena, porque la contrabarra se interpretaría como que se estaría escapando la comilla final.

source: and the C<S_IF*> functions are
es_es: y las funciones C<S_IF*> son

source: In scalar context, each call reads and returns the next line until end-of-file is reached, whereupon the subsequent call returns C<undef>.
es_es: En contexto escalar, cada llamada lee y devuelve la siguiente línea hasta que se alcance el final del archivo, en cuyo caso la ulterior llamada devuelve C<undef>.

source: if (/Time: (..):(..):(..)/) { # parse out values
es_es: if (/Tiempo: (..):(..):(..)/) { # extrae valores

source: WRITE this, scalar, length, offset
es_es: WRITE este, escalar, longitud, desplazamiento

source: =head2 No-ops X<no-op> X<nop>
es_es: =head2 No-operaciones X<no-op> X<nop>

source: It operates on C<$_> by default, or can be bound to another variable using the C<=~> binding operator (also documented in L<perlop>).
es_es: Opera en C<$_> de manera predeterminada, o se puede enlazar a otra variable con el operador de enlace C<=~> (que también se describe en L<perlop>).

source: Changes the owner (and group) of a list of files.
es_es: Cambia el propietario (y grupo) de una lista de archivos.

source: for a seed can fall prey to the mathematical property that
es_es: pero la semilla puede caer presa en la propiedad matemática

source: $ARTICLE = 100;
es_es: $ARTICULO = 100;

source: =head1 DATE
es_es: =head1 FECHA

source: As of Perl 5.10.0, one can create custom regular expression engines.
es_es: A partir de Perl 5.10.0, uno puede crear sus propios motores de expresiones regulares.

source: LABEL foreach VAR (LIST) BLOCK
es_es: ETIQUETA foreach VAR (LIST) BLOQUE

source: The following items are now deprecated.
es_es: Los siguientes artículos son ahora obsoletos.

source: Once those changes are applied and released, the new version of the module will be incorporated into the core.
es_es: Cuando se hayan aplicado y publicado estos cambios, la nueva versión del módulo se incorporará al núcleo.

source: These include such functions as C<time> and C<endpwent>.
es_es: Estas incluyen funciones como C<time> y C<endpwent>.

source: That's because C<*HANDLE{IO}> only works if HANDLE has already been used as a handle.
es_es: Esto es porque C<*HANDLE{IO}> sólo funciona si HANDLE ya se ha utilizado como un identificador.

source: B<C<rand()> is not cryptographically secure.
es_es: B<C<rand()> no es criptográficamente seguro.

source: As this behavior is currently considered a bug, compatible behavior may be re-introduced in a future release.
es_es: Ya que este comportamiento se considera actualmente un error, un comportamiento compatible puede ser re-introducido en una futura versión.

source: C<Pod::Html> upgraded to version 1.0504
es_es: C<Pod::Html> actualizado a la versión 1.0504

source: This pragma allows you to lexically disable or enable overloading for some or all operations.
es_es: Este pragma le permite desactivar o activar localmente la sobrecarga de algunas o todas las operaciones.

source: for an example of how to use the "eval exec" trick to ask the shell to have perl run your scripts for you.
es_es: para ver un ejemplo de cómo utilizar el truco del "eval exec" para hacer que el shell ejecute por usted los scripts perl.

source: Then give "make" to compile.
es_es: Luego ejecute "make" para compilar.

source: If EXPR is omitted, exits with C<0> status.
es_es: Si EXPR es omitida, sale con estado C<0>.

source: Again, there is a distinction between omitting LIST (C<import> called with no arguments) and an explicit empty LIST C<()> (C<import> not called).
es_es: Una vez más, hay una distinción entre omitir LISTA (C<import> llamado sin argumentos) y una explícita LISTA vacía C<()> (C<import> no se llama).

source: Use only these specific hex characters with this format.
es_es: Utilice sólo estos caracteres hexadecimales con este formato.

source: With or without parentheses, an empty list is returned upon failure.
es_es: Con o sin paréntesis, se devuelve una lista vacía en caso de error.

source: perlvos Perl notes for Stratus VOS
es_es: perlvos Notas para Stratus VOS

source: This time it goes all the way until the next occurrence of "foo".
es_es: Esta vez hace todo el camino hasta la siguiente ocurrencia de "come".

source: Some systems may have even weirder byte orders such as
es_es: Algunos sistemas pueden tener ordenaciones de byte aún más raras.

source: This form is typically used to delay parsing and subsequent execution of the text of EXPR until run time.
es_es: Esta forma es típicamente usada para retrasar el interpretado subsecuente ejecución del texto de EXPR hasta el momento de la ejecución.

source: This property, known as "magic open", can often be used to good effect.
es_es: Esta propiedad, conocida como "open() mágico", a menudo se puede utilizar con buenos resultados.

source: ($user,$system,$cuser,$csystem) = times;
es_es: ($usuario,$sistema,$husuario,$hsistema) = times;

source: my $z = substr $s, 14, 7, "jumped from"; # climbed
es_es: my $z = substr $s, 14, 5, "saltó desde"; # subió

source: my $ALL = shift;
es_es: my $TODO = shift;

source: If you want a "real" C C<open> (see C<open(2)> on your system), then you should use the C<sysopen> function, which involves no such magic (but may use subtly different filemodes than Perl open(), which is mapped to C fopen()).
es_es: Si busca un "auténtico" C<open> como en C (ver C<open(2)> en su sistema), entonces debe usar la función C<sysopen>, que no incluye ninguna magia (pero puede utilizar, sutilmente, diferentes modos de archivo que el open() de Perl, que es asignado a la función del C fopen()).

source: Returns the address of the sender if SOCKET's protocol supports this; returns an empty string otherwise.
es_es: Devuelve la dirección del remitente si el protocolo del SOCKET lo soporta; de otra manera, devuelve una cadena vacía.

source: The result C<Regexp> indicates that the argument is a regular expression resulting from C<qr//>.
es_es: El resultado C<Regexp> indica que el argumento es una expresión regular como resultado de C<qr//>.
